app/views/lists/_list.html.erb

SELECT COUNT(*) FROM `members` WHERE `members`.`list_id` = 1
INSERT INTO `lists` (`created_at`, `name`, `updated_at`) VALUES ('2012-06-14 02:58:27', 'myClientsList', '2012-06-14 02:58:27')
---
  <td><%= link_to list.name, list_path(list) %></td>
  <td><%= list.members.size %></td>
  <td><%= list.created_at.strftime("%F %T") %></td>