app/views/entries/destroy.js.erb

$("#<%= dom_id @entry %>").remove();
<% if @template.entries.empty? %>
---
SELECT COUNT(*) FROM `entries` WHERE `entries`.`template_id` = 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`template_id` = 1 AND `entries`.`id` = 3 LIMIT 1