app/views/templates/_template.html.erb

SELECT `entries`.* FROM `entries` WHERE `entries`.`template_id` = 1
---
  <div class="entries_info" style="display:none;">
    <% has_entries = template.entries && template.entries.present? %>