app/views/clicks/index.html.erb

<% if @clicks.present? %>
<div class="header">链接点击分析<small>(<%= @clicks.first().campaign.subject %>)(<%= @click_data.click_num %>次数|<%= @click_data.peo_num %>人次)</small></div>
---
SELECT `clicks`.* FROM `clicks` LIMIT 20 OFFSET 0