app/controllers/campaigns_controller.rb

  def index
    require 'will_paginate/array'
    #@campaigns = Campaign.all
    #@campaign = Campaign.new
    user_id = current_user.id
    #userids = [6,7,8,9,10,12,13]
    if user_action_org then
      @campaigns = Campaign.paginate(:page => params[:page], :per_page => 6,:order => "updated_at desc")
      @campaign = Campaign.new
      @lists = List.where("is_used != false")
      @templates = Template.all
    else
      controller = "Campaign"
      orglist = FocusMail::ListUserorg::userorg_list(user_id, controller)
      if orglist.empty?
        @campaigns = nil
      else
        #@campaigns = Campaign.find(orglist).paginate(:page => params[:page], :per_page => 6,:order => "updated_at desc")
        @campaigns = Campaign.paginate(:page => params[:page], :per_page => 6, :conditions => "id in (#{orglist.join(',')})" , :order => "updated_at desc")
      end
      @campaign = Campaign.new
      @campaign.org_id = FocusMail::ListUserorg::userorg_id(user_id)
      controller = "Template"
      orglist = FocusMail::ListUserorg::userorg_list(user_id, controller)
      @templates = Template.find(orglist)
---
SELECT `campaigns`.* FROM `campaigns`
SELECT `templates`.* FROM `templates`
SELECT `lists`.* FROM `lists`
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 2 LIMIT 1

  def new
    user_id = current_user.id
    @campaign = Campaign.new
    @campaign.org_id = FocusMail::ListUserorg::userorg_id(user_id)
    #userids = [6,7,8,9,10,12,13]
    if user_action_org then
      @lists = List.where("is_used != false")
      @templates = Template.all
---
SELECT `templates`.* FROM `templates`

  def edit
    user_id = current_user.id
    #userids = [6,7,8,9,10,12,13]
    if user_action_org then
      @campaign = Campaign.find(params[:id])
      @lists = List.where("is_used != false")
      @templates = Template.all
    else
      @campaign = Campaign.find(params[:id])
      @campaign.org_id = FocusMail::ListUserorg::userorg_id(user_id)
      controller = "Template"
      orglist = FocusMail::ListUserorg::userorg_list(user_id, controller)
      @templates = Template.find(orglist)
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
SELECT `templates`.* FROM `templates`
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 2 LIMIT 1

  def create
    @campaign = Campaign.new(params[:campaign])

    if params[:campaign][:from_time] != "" then
      strdate = params[:datepicker].to_s
      strhour = params[:selecthour].to_i
      strminute = params[:selectminute].to_i
      strsecond = params[:selectsecond].to_i
      if strdate != nil && strdate != "" then
        datearray = strdate.split("-")
        stryear = datearray[0].to_i
        strmonth = datearray[1].to_i
        strday = datearray[2].to_i
        strdatetime = Time.new(stryear,strmonth,strday,strhour,strminute,strsecond, "+08:00")
        strnow = Time.now
        strdatetime = Time.at(strnow.to_i+60) if strnow >= strdatetime

        Resque.enqueue_at(strdatetime, Sendmail_Job, params[:id], current_user.id)
      end
    end

    user_id = current_user.id
    #userids = [6,7,8,9,10,12,13]
    if user_action_org then
      @lists = List.where("is_used != false")
      @templates = Template.all
    else
      controller = "Template"
      orglist = FocusMail::ListUserorg::userorg_list(user_id, controller)
      @templates = Template.find(orglist)

      controller = "List"
      orglist = FocusMail::ListUserorg::userorg_list(user_id, controller)
      @lists = List.find(orglist).select{ |l| l.is_used != false }
    end

    respond_to do |format|
      if @campaign.save
---
SELECT `templates`.* FROM `templates`
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 2 LIMIT 1
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
INSERT INTO `campaigns` (`created_at`, `from_email`, `from_name`, `name`, `subject`, `template_id`, `updated_at`) VALUES ('2012-06-15 04:11:50', 'user06＠intfcous.com', 'infocus', '十一假期活动', '所有商品打三折', 2, '2012-06-15 04:11:50')

  def update
    @campaign = Campaign.find(params[:id])
    if params[:campaign][:from_time] != "" then
      if @campaign.from_time != nil && @campaign.from_time != "" then
        Resque.remove_delayed(Sendmail_Job, params[:id], current_user.id)
      end
      strdate = params[:datepicker].to_s
      strhour = params[:selecthour].to_i
      strminute = params[:selectminute].to_i
      strsecond = params[:selectsecond].to_i
      if strdate != nil && strdate != "" then
        datearray = strdate.split("-")
        stryear = datearray[0].to_i
        strmonth = datearray[1].to_i
        strday = datearray[2].to_i
        strdatetime = Time.new(stryear,strmonth,strday,strhour,strminute,strsecond, "+08:00")
        strnow = Time.now
        strdatetime = Time.at(strnow.to_i+60) if strnow >= strdatetime
        Resque.enqueue_at(strdatetime, Sendmail_Job, params[:id], current_user.id)
      end
    else
      if @campaign.from_time != nil && @campaign.from_time != "" then
        Resque.remove_delayed(Sendmail_Job, params[:id], current_user.id)
      end
    end

    user_id = current_user.id
    #userids = [6,7,8,9,10,12,13]
    if user_action_org then
      @lists = List.where("is_used != false")
      @templates = Template.all
    else
      controller = "Template"
      orglist = FocusMail::ListUserorg::userorg_list(user_id, controller)
      @templates = Template.find(orglist)

      controller = "List"
      orglist = FocusMail::ListUserorg::userorg_list(user_id, controller)
      @lists = List.find(orglist).select{ |l| l.is_used != false }
    end

    respond_to do |format|
      if @campaign.update_attributes(params[:campaign])
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
SELECT `templates`.* FROM `templates`
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
UPDATE `campaigns` SET `name` = 'user', `subject` = 'subject', `template_id` = 1, `updated_at` = '2012-06-15 07:03:24' WHERE `campaigns`.`id` = 1

  def destroy
    @campaign = Campaign.find(params[:id])
    @campaign.destroy
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
DELETE FROM `campaigns` WHERE `campaigns`.`id` = 1

  def template_entries
    @template = Template.find(params[:t_id])
    # because sometime @campaign does not exist when it's a new one
    @campaign = Campaign.find_by_id(params[:c_id])
---
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 2 LIMIT 1
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 0 LIMIT 1