app/controllers/clicks_controller.rb

SELECT `clicks`.* FROM `clicks` LIMIT 20 OFFSET 0
---
  def index
    @clicks = Click.includes(:member, :campaign, :link).paginate(:page => params[:page], :per_page => 10)