app/controllers/entries_controller.rb

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
---
  def new
    @template = Template.find(params[:template_id])

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 3 LIMIT 1
---
  def new_image
    @template = Template.find(params[:template_id])

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`template_id` = 1 AND `entries`.`id` = 1 LIMIT 1
---
  def edit
    @template = Template.find(params[:template_id])
    @entry = @template.entries.find(params[:id])

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
INSERT INTO `entries` (`created_at`, `default_value`, `name`, `template_id`, `updated_at`) VALUES ('2012-06-15 02:20:19', 'hello world', '默认主题', 1, '2012-06-15 02:20:19')
UPDATE `entries` SET `default_value` = '#/public/images/310', `created_at` = '2012-06-20 01:36:27', `updated_at` = '2012-06-20 01:36:27' WHERE `entries`.`id` = 41
---
  def create
    @template = Template.find(params[:template_id])
    @entry = @template.entries.create(params[:entry])

     if deal_with_image_entry(@template,@entry,params[:image],true)
      @is_image = true
      @img_path = img_path(@entry)
     end

    respond_to do |format|
      if @entry.save

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`template_id` = 1 AND `entries`.`id` = 1 LIMIT 1
UPDATE `entries` SET `default_value` = 'www.railscasts.com', `updated_at` = '2012-06-16 07:51:01' WHERE `entries`.`id` = 2
---
  def update
    @template = Template.find(params[:template_id])
    @entry = @template.entries.find(params[:id])

    deal_with_image_entry(@template,@entry,params[:image],false)

    respond_to do |format|
      if @entry.update_attributes(params[:entry])

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`template_id` = 1 AND `entries`.`id` = 3 LIMIT 1
DELETE FROM `entries` WHERE `entries`.`id` = 3
---
  def destroy
    @template = Template.find(params[:template_id])
    @entry = @template.entries.find(params[:id])

    file_path = "#{@entry.default_value}"
    dir_path = File.dirname(file_path)
    if File.file?(file_path)
				  File.delete(file_path)
				  Dir.rmdir(dir_path) if File.exists?(dir_path)
    end
    @entry.destroy