app/controllers/home_controller.rb

  def preview
    campaign = Campaign.find(params[:campaign_id])
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 4 LIMIT 1