app/controllers/lists_controller.rb

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
---
  def edit
    @list = List.find(params[:id])

INSERT INTO `lists` (`created_at`, `name`, `updated_at`) VALUES ('2012-06-14 02:58:27', 'myClientsList', '2012-06-14 02:58:27')
---
  def create
    @list = List.new(params[:list])
    #is_used表示该名单列表在使用中
    @list.is_used = true

    respond_to do |format|
      if @list.save

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
---
  def destroy
    @list = List.find(params[:id])