app/controllers/members_controller.rb

  def index
    @list = List.find(params[:list_id])
    @members = @list.members.paginate(:page => params[:page], :per_page => 10)
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `members` WHERE `members`.`list_id` = 1
SELECT `members`.* FROM `members` WHERE `members`.`list_id` = 1 LIMIT 20 OFFSET 0

  def show
    @list = List.find(params[:list_id])
    @member = Member.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1

  def new
    @list = List.find(params[:list_id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1

  def edit
    @list = List.find(params[:list_id])
    @member = @list.members.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`list_id` = 1 AND `members`.`id` = 1 LIMIT 1

  def create
    @list = List.find(params[:list_id])
    @member = @list.members.create(params[:member])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
INSERT INTO `members` (`created_at`, `email`, `list_id`, `name`, `updated_at`) VALUES ('2012-06-24 08:27:25', 'jay_li@intfocus.com', 1, 'jay', '2012-06-24 08:27:25')

  def destroy
    @list = List.find(params[:list_id])
    @member = @list.members.find(params[:id])
    @member.destroy
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 2 LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`list_id` = 2 AND `members`.`id` = 3 LIMIT 1
DELETE FROM `members` WHERE `members`.`id` = 3

  def import
    require 'csv'
    @list = List.find(params[:list_id])
    file = MemberUploader.new
    file.store!(params[:file])
    @members = []
    @errors = Hash.new
    @counter = 0

    if params[:type] == 'xls'
      # import from excel
      book = Spreadsheet.open "#{file.store_path}"
      sheet1 = book.worksheet 0

      sheet1.each 1 do |row|
        @counter+=1
        p = Member.new
        Member.get_field_array.each_with_index do |field, i|
          p.send("#{field[0]}=", row[i])
        end

        if p.valid?
          p.list = @list
          p.save!
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
INSERT INTO `members` (`created_at`, `email`, `list_id`, `name`, `updated_at`) VALUES ('2012-06-16 02:12:17', 'jay_li@intfocus.com', 1, 'jay', '2012-06-16 02:12:17')