app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT `templates`.* FROM `templates`

  def show
    @template = Template.find(params[:id])
---
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1

  def edit
    @template = Template.find(params[:id])
---
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1

  def create
    @template = Template.new(params[:template])

    respond_to do |format|
      if @template.save
---
INSERT INTO `templates` (`created_at`, `file_name`, `name`, `updated_at`) VALUES ('2012-06-18 02:32:36', 'intfocus', 'jay', '2012-06-18 02:32:36')

  def update
    @template = Template.find(params[:id])

    respond_to do |format|
      if @template.update_attributes(params[:template])
---
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
UPDATE `templates` SET `file_name` = 'jay_li', `updated_at` = '2012-06-27 02:00:04' WHERE `templates`.`id` = 1

  def destroy
    @template = Template.find(params[:id])
    @template.destroy
---
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 1 LIMIT 1
DELETE FROM `templates` WHERE `templates`.`id` = 1

  def dyna_source
    @template = Template.find(params[:id])
---
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 5 LIMIT 1