app/controllers/tracks_controller.rb

SELECT `tracks`.* FROM `tracks` LIMIT 20 OFFSET 0
---
  def index
    @tracks = Track.includes(:member, :campaign).paginate(:page => params[:page], :per_page => 10)