app/views/campaigns/_campaign.html.erb


			  			    	<div>创建时间:<span><%= campaign.created_at ==nil ? '未保存' : campaign.created_at.strftime("%Y/%m/%d") %></span></div>
---
INSERT INTO `campaigns` (`created_at`, `from_email`, `from_name`, `name`, `subject`, `template_id`, `updated_at`) VALUES ('2012-06-15 04:11:50', 'user06＠intfcous.com', 'infocus', '十一假期活动', '所有商品打三折', 2, '2012-06-15 04:11:50')

         <% @lists.each_with_index do |list,index| %>
           <% if campaign.lists.include?(list) -%>
---
SELECT DISTINCT `lists`.* FROM `lists` INNER JOIN `campaign_lists` ON `lists`.`id` = `campaign_lists`.`list_id` WHERE `campaign_lists`.`campaign_id` = 1