app/views/campaigns/_form.html.erb

SELECT `lists`.* FROM `lists`
SELECT DISTINCT 1 FROM `lists` INNER JOIN `campaign_lists` ON `lists`.`id` = `campaign_lists`.`list_id` WHERE `campaign_lists`.`campaign_id` IS NULL AND `lists`.`id` = 1 LIMIT 1
SELECT `campaigns`.* FROM `campaigns`
---
          <div class="controls">
            <% List.all.each do |list| %>
              <%= check_box_tag :list_ids, list.id, @campaign.lists.include?(list), :name => 'campaign[list_ids][]' -%>

SELECT `templates`.* FROM `templates`
---
          <div class="controls">
            <%= f.select :template_id, ActiveRecord::Base::Template.all.map{|t| [t.name, t.id]}, { :include_blank => true}, {:class => "chzn-select", "data-placeholder" => "Choose a Template"} %>

SELECT `entries`.* FROM `entries` WHERE `entries`.`template_id` = 2
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 2 LIMIT 1
---
          <% if @campaign && @campaign.template %>
            <% @campaign.template.entries.each do |entry| %>