app/views/campaigns/_template_entries.html.erb

<% if template && template.entries %>
  <% template.entries.each do |entry| %>
---
SELECT `entries`.* FROM `entries` WHERE `entries`.`template_id` = 2