app/views/members/destroy.js.erb

$("#<%= dom_id @member %>").remove();
<% if @list.members.empty? %>
---
SELECT COUNT(*) FROM `members` WHERE `members`.`list_id` = 2
SELECT `members`.* FROM `members` WHERE `members`.`list_id` = 2 AND `members`.`id` = 3 LIMIT 1