app/views/members/import.html.erb

INSERT INTO `members` (`created_at`, `email`, `list_id`, `name`, `updated_at`) VALUES ('2012-06-16 02:12:17', 'jay_li@intfocus.com', 1, 'jay', '2012-06-16 02:12:17')
---
          <td><%= member.email %></td>
          <td><%= member.created_at.strftime("%F %T") %></td>