app/views/members/index.html.erb

<br />
<h3>There are <%= @list.members.size %> members</h3>
---
SELECT COUNT(*) FROM `members` WHERE `members`.`list_id` = 1